Clean terraform plan running `task staging-plan`:
```
task: Task "init staging" is up to date
task: [plan staging] terraform -chdir=env/staging plan -out plan.plan
module.epp.aws_iam_policy.read_write_sources: Refreshing state... [id=arn:aws:iam::512686554592:policy/epp-staging-s3-read-write-sources]
module.epp.aws_iam_policy.read_write: Refreshing state... [id=arn:aws:iam::512686554592:policy/epp-staging-s3-read-write]
module.epp.aws_iam_policy.become_biorxiv_role: Refreshing state... [id=arn:aws:iam::512686554592:policy/epp-staging-become-access-biorxiv-xml-role]
module.epp.aws_iam_policy.read_biorxiv_bucket: Refreshing state... [id=arn:aws:iam::512686554592:policy/epp-staging-read-biorxiv-bucket]
module.epp.aws_iam_role.epp_server_role: Refreshing state... [id=epp-staging-epp-server]
module.epp.aws_iam_policy.read_only_data_prefix: Refreshing state... [id=arn:aws:iam::512686554592:policy/epp-staging-s3-read-only-data-prefix]
module.epp.aws_iam_policy.read_prod_sources: Refreshing state... [id=arn:aws:iam::512686554592:policy/epp-staging-s3-read-prod-sources]
module.epp.aws_iam_group.developers: Refreshing state... [id=epp-staging-developers]
module.epp.aws_s3_bucket.meca_bucket: Refreshing state... [id=staging-elife-epp-meca]
module.epp.aws_s3_bucket.main_bucket: Refreshing state... [id=staging-elife-epp-data]
module.epp.aws_iam_policy.read_only: Refreshing state... [id=arn:aws:iam::512686554592:policy/epp-staging-s3-read-only]
module.epp.aws_iam_role.image_server_role: Refreshing state... [id=epp-staging-image-server]
module.epp.aws_iam_group_policy_attachment.read-write-role-policy-attachment: Refreshing state... [id=epp-staging-developers-20230310150834863500000001]
module.epp.aws_iam_group_policy_attachment.read_become_biorxiv_role_attachment: Refreshing state... [id=epp-staging-developers-20230522094411226000000004]
module.epp.aws_iam_role.import_role: Refreshing state... [id=epp-staging-import]
module.epp.aws_iam_group_policy_attachment.read_write_sources_production_attachment: Refreshing state... [id=elife-production-20230906084303211500000001]
module.epp.aws_s3_bucket.pdf_bucket: Refreshing state... [id=staging-elife-epp-pdf]
module.epp.aws_iam_role_policy_attachment.epp_server_read_only_role_policy_attachment: Refreshing state... [id=epp-staging-epp-server-20230522111031121700000001]
module.epp.aws_iam_group_policy_attachment.read_only_production_attachment: Refreshing state... [id=elife-production-20230906162015422300000001]
module.epp.aws_iam_role_policy_attachment.image_server_read_only_role_policy_attachment: Refreshing state... [id=epp-staging-image-server-20230522094410872500000003]
module.epp.aws_iam_role_policy_attachment.import-role-biorxiv-access-policy-attachment: Refreshing state... [id=epp-staging-import-20230522094410872500000002]
module.epp.aws_iam_role_policy_attachment.import-role-access-to-prod-sources-policy-attachment: Refreshing state... [id=epp-staging-import-20230920095911487900000001]
module.epp.aws_iam_role_policy_attachment.import-role-s3-read-write-policy-attachment: Refreshing state... [id=epp-staging-import-20230522094410849000000001]
module.epp.data.aws_iam_policy_document.topic: Reading...
module.epp.data.aws_iam_policy_document.topic: Read complete after 0s [id=2230284516]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.epp.aws_s3_bucket_notification.meca_bucket_notification will be created
  + resource "aws_s3_bucket_notification" "meca_bucket_notification" {
      + bucket      = "staging-elife-epp-meca"
      + eventbridge = false
      + id          = (known after apply)

      + topic {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = (known after apply)
          + topic_arn = (known after apply)
        }
    }

  # module.epp.aws_sns_topic.meca_bucket_notification_topic will be created
  + resource "aws_sns_topic" "meca_bucket_notification_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "staging-elife-epp-meca"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + ArnLike = {
                              + "aws:SourceArn" = "arn:aws:s3:::staging-elife-epp-meca"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sns:*:*:staging-elife-epp-meca"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
```